# Dictionaries

## List

Q1. From the below list find the index value of "Mangoes" and then using the index value find the quantity of mangoes. (1 mark)

In [3]:
fruits = ["Apple", "Oranges", "Kiwi", "Mangoes", "Banana"]
Quantity = [7, 5, 10, 8, 3]

In [5]:
### START CODE HERE : 
mangoes_index = fruits.index('Mangoes')
Quantity[mangoes_index]
### END CODE

8

Since these is not so convenient method so instead we use dictionary

## Dictionary

Q1. From the below dictionary find the quantity of "Banana". (1 mark)

In [6]:
dict = {"Apple":7, "Oranges":5, "Kiwi":10, "Mangoes":8, "Banana":3}

### START CODE HERE : 
dict['Banana']
### END CODE

3

Q2. Add "Plum" fruit with quantity 15 in the dict. (1 mark)

In [8]:
### START CODE HERE : 
dict['Plum'] = 15
dict
### END CODE

{'Apple': 7, 'Banana': 3, 'Kiwi': 10, 'Mangoes': 8, 'Oranges': 5, 'Plum': 15}

Q3. Check if "Banana" is present in dict. (1 mark)

In [11]:
### START CODE HERE : 
if 'Banana' in dict:
  print(True)
### END CODE

True

Q4. Delete "Banana" from dict. (1 mark)

In [12]:
### START CODE HERE : 
dict.pop('Banana')
dict
### END CODE

{'Apple': 7, 'Kiwi': 10, 'Mangoes': 8, 'Oranges': 5, 'Plum': 15}

## Pandas

In [14]:
df = {
    "Name": ["aparna", "pankaj", "sudhir", "Geeku", "Chiku", "Jeniffer"], 
    "Degree": ["Bsc", "Engineering", "Law", "MBBS", "Phd", "Nursing"],
    "College": ["VIT", "IIT", "KIIT", "AIMS", "IIIT", "APPOLO"],
    "Score": [90, 70, 80, 98, 76, 89]}

In [15]:
import pandas as pd

Q1. Using pandas convert the above df into DataFrame and read it. (1 mark)

In [16]:
### START CODE HERE : 
dataframe = pd.DataFrame(df)
dataframe
### END CODE

       Name       Degree College  Score
0    aparna          Bsc     VIT     90
1    pankaj  Engineering     IIT     70
2    sudhir          Law    KIIT     80
3     Geeku         MBBS    AIMS     98
4     Chiku          Phd    IIIT     76
5  Jeniffer      Nursing  APPOLO     89

Q2. Change the index value to ("B", "E", "L", "M", "P", "N") respectively for the dict. (1 mark)

In [17]:
### START CODE HERE : 
dataframe = pd.DataFrame(data = df, index =["B", "E", "L", "M", "P", "N"] )
dataframe
### END CODE

       Name       Degree College  Score
B    aparna          Bsc     VIT     90
E    pankaj  Engineering     IIT     70
L    sudhir          Law    KIIT     80
M     Geeku         MBBS    AIMS     98
P     Chiku          Phd    IIIT     76
N  Jeniffer      Nursing  APPOLO     89

Solve the following question for Column Access:
    
    a. Access the column Name. (1 mark)
    
    b. Find the type of the column Name (1 mark)
    
    c. Access two column (Name & Degree) at a time (1 mark)

In [18]:
### a. START CODE HERE : 
col_names =  dataframe.columns
col_names
### END CODE

Index(['Name', 'Degree', 'College', 'Score'], dtype='object')

In [19]:
### b. START CODE HERE : 
type(col_names)
### END CODE

pandas.core.indexes.base.Index

In [21]:
### c. START CODE HERE : 
col_name= dataframe.columns[0:2]
col_name
### END CODE

Index(['Name', 'Degree'], dtype='object')

Solve for Row Access:
    
    a. Access first three rows of dict. (1 mark)
    
    b. Access rows from second to fourth row. (1 mark)

In [24]:
### a. START CODE HERE : 
rows = dataframe[0:3]
rows
### END CODE

     Name       Degree College  Score
B  aparna          Bsc     VIT     90
E  pankaj  Engineering     IIT     70
L  sudhir          Law    KIIT     80

In [28]:
### b. START CODE HERE : 
rows = dataframe[1:4]
rows
### END CODE

     Name       Degree College  Score
E  pankaj  Engineering     IIT     70
L  sudhir          Law    KIIT     80
M   Geeku         MBBS    AIMS     98

Use the **.loc** function to solve below questions:

   Q1. Access the **B** row. (1 mark)

   Q2. Access **B , M & L** row at once. (1 mark)

   Q3. Access **B , M** row & **Name , Score** column. (1 mark)

   Q4. Access all row with just **Name & Degree** column. (1 mark)

In [31]:
### Q1. START CODE HERE : 
rowsloc = dataframe.loc['B']
rowsloc
### END CODE

Name       aparna
Degree        Bsc
College       VIT
Score          90
Name: B, dtype: object

In [33]:
### Q2. START CODE HERE : 
rowsloc = dataframe.loc[['B','M','L']]
rowsloc
### END CODE

     Name Degree College  Score
B  aparna    Bsc     VIT     90
M   Geeku   MBBS    AIMS     98
L  sudhir    Law    KIIT     80

In [38]:
### Q3. START CODE HERE : 
rowsloc = dataframe.loc[['B','M'], ['Name', 'Score']]
rowsloc
### END CODE

     Name  Score
B  aparna     90
M   Geeku     98

In [40]:
### Q4. START CODE HERE : 
rowsloc = dataframe.loc['B':'N', ['Name', 'Degree']]
rowsloc
### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing

Use .iloc function to solve the following questions:

Q1. Access the 3rd row. (1 mark)

Q2. Access the first 3 row. (1 mark)

Q3. Access first 3 row and first 3 column.(1 mark)

Q4. Access all row with name & Degree column. (1 mark)

In [44]:
### Q1. START CODE HERE : 
rowsiloc = dataframe.iloc[4]
rowsiloc
### END CODE

Name       Chiku
Degree       Phd
College     IIIT
Score         76
Name: P, dtype: object

In [45]:
### Q2. START CODE HERE : 
rowsiloc = dataframe.iloc[0:4]
rowsiloc
### END CODE

     Name       Degree College  Score
B  aparna          Bsc     VIT     90
E  pankaj  Engineering     IIT     70
L  sudhir          Law    KIIT     80
M   Geeku         MBBS    AIMS     98

In [48]:
### Q3. START CODE HERE : 
rowsiloc = dataframe.iloc[0:4, 0:3]
rowsiloc
### END CODE

     Name       Degree College
B  aparna          Bsc     VIT
E  pankaj  Engineering     IIT
L  sudhir          Law    KIIT
M   Geeku         MBBS    AIMS

In [49]:
### Q4. START CODE HERE : 
rowsiloc = dataframe.iloc[:,0:2]
rowsiloc
### END CODE

       Name       Degree
B    aparna          Bsc
E    pankaj  Engineering
L    sudhir          Law
M     Geeku         MBBS
P     Chiku          Phd
N  Jeniffer      Nursing